"""
Let's keep constants in this file
"""

SPECIAL_TOKENS = {'<bos>', '<eos>', '<pad>'}

PREFIXES = {
    "без", "бес", "в", "во", "вз", "взо", "вс", "вне", "внутри", "воз", "возо", "вос", "все",
    "вы", "до", "за", "из", "изо", "ис", "испод", "к", "кое", "кой", "меж", "междо", "между", "на",
    "над", "надо", "наи", "не", "небез", "небес", "недо", "ни", "низ", "низо", "нис", "о", "об",
    "обо", "обез", "обес", "около", "от", "ото", "па", "пере", "по", "под", "подo", "поза", "после",
    "пра", "пре", "пред", "предо", "преди", "при", "про", "противо", "раз", "разо", "рас", "роз",
    "рос", "с", "со", "сверх", "среди", "су", "сыз", "тре", "у", "чрез", "через", "черес",
}